---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.LayoutConnector
source: html/22e8164e-0545-e74c-c568-4bcf15c1971a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.LayoutConnector Property

[Unassigned System Type] on Connector [Index Number].

## Syntax (C#)
```csharp
public static FailureDefinitionId LayoutConnector { get; }
```